import 'package:flutter/material.dart';

class AppData {
  static Widget getWidget(BuildContext context, Map<String, dynamic> map, double pad) {
    if (map['code'] == 'para') {
      return Padding(
        padding: EdgeInsets.all(pad),
        child: Text(
          map['content'].toString(),
          style: TextStyle(color: Colors.purpleAccent[700]),
        ),
      );
    } else if (map['code'] == 'img') {
      return Padding(
        padding: EdgeInsets.all(pad),
        child: Image.network(
          map['content'].toString(),
          fit: BoxFit.fill,
        ),
      );
    }
  }

  static final List<Map<String, dynamic>> articleData = [
    {
      'code': 'img',
      'rank': '0',
      'content':
          'https://m.hindustantimes.com/rf/image_size_1200x900/HT/p2/2020/06/09/Pictures/india-china-standoff_c955e02c-a9ed-11ea-ae1e-6e34c87b3b2e.jpg',
    },
    {
      'code': 'para',
      'rank': '1',
      'content':
          'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
    },
    {
      'code': 'img',
      'rank': '2',
      'content':
          'https://m.hindustantimes.com/rf/image_size_1200x900/HT/p2/2020/07/05/Pictures/defence-minister-inducts-systems-major-artillery-gun_40c82576-bedd-11ea-b1db-f4c281a9a9e5.jpg',
    },
    {
      'code': 'para',
      'rank': '3',
      'content':
          'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
    },
    {
      'code': 'img',
      'rank': '2',
      'content':
          'https://images.goodsmile.info/cgm/images/product/20200722/9819/72343/large/59708ae433df2f76720c1956a6a77e16.jpg',
    },
    {
      'code': 'para',
      'rank': '3',
      'content':
          'ধারা ২ এ ঘোষণায় উল্লেখিত স্বাধীনতা এবং অধিকারসমূহে গোত্র, ধর্ম, বর্ণ, শিক্ষা, ভাষা, রাজনৈতিক বা অন্যবিধ মতামত, জাতীয় বা সামাজিক উত্‍পত্তি, জন্ম, সম্পত্তি বা অন্য কোন মর্যাদা নির্বিশেষে প্রত্যেকের‌ই সমান অধিকার থাকবে। কোন দেশ বা ভূখণ্ডের রাজনৈতিক, সীমানাগত বা আন্তর্জাতিক মর্যাদার ভিত্তিতে তার কোন অধিবাসীর প্রতি কোনরূপ বৈষম্য করা হবেনা; সে দেশ বা ভূখণ্ড স্বাধীন‌ই হোক, হোক অছিভূক্ত, অস্বায়ত্বশাসিত কিংবা সার্বভৌমত্বের অন্য কোন সীমাবদ্ধতায় বিরাজমান।',
    },
    {
      'code': 'tab',
      'rank': '4',
      'content': {
        'TAB A LABEL': [
          {
            'code': 'para',
            'rank': '3',
            'content':
                'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
          },
          {
            'code': 'img',
            'rank': '0',
            'content':
                'https://i0.wp.com/olives-n-okra.com/wp-content/uploads/2011/11/steamed-pumpkin1.jpg',
          },
          {
            'code': 'para',
            'rank': '3',
            'content':
                'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
          },
          {
            'code': 'img',
            'rank': '0',
            'content':
                'https://corpwebstorage.blob.core.windows.net/media/41143/artillery-systems-l2.jpg',
          },
          {
            'code': 'para',
            'rank': '3',
            'content':
                'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
          },
        ],
        'TAB B LABEL': [
          {
            'code': 'para',
            'rank': '3',
            'content':
                'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
          },
          {
            'code': 'img',
            'rank': '0',
            'content':
                'https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcTZLlRRfplid441NFXEVdTyRKlYSdphvvEPoQ&usqp=CAU',
          },
          {
            'code': 'para',
            'rank': '3',
            'content':
                'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
          },
          {
            'code': 'img',
            'rank': '0',
            'content':
                'https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRciYh24YN9I7XC9BOUIJg7WCwGuYG4FP-jvg&usqp=CAU',
          },
          {
            'code': 'para',
            'rank': '3',
            'content':
                'প্লাবনের পরে সমস্ত পৃথিবী এক ভাষাতে কথা বলত| সমস্ত মানুষ একই শব্দগুলি ব্যবহার করত সেই লোকেরা পূর্ব দিক থেকে ঘুরতে ঘুরতে শিনিয়র দেশে এসে সমতল ভূমি পেল| তারা সেখানে বসবাস শুরু করল তারা বলল, “আমরা মাটি দিয়ে ইঁট তৈরী করব, তারপর আরও শক্ত করার জন্যে ইঁটগুলো পোড়াব|” তখন মানুষ পাথরের বদলে ইঁট দিয়ে বাড়ী তৈরী করল| আর গাঁথনি শক্ত করার জন্যে সিমেন্টের বদলে আলকাতরা ব্যবহার করল',
          },
        ],
      },
    }
  ];
}
